In [1]:
people = {
    'first': ['amit','vinay','ankit'],
    'last':['pratap', 'singh','mishra'],
    'email':['amitoct9@gmail.com','vinaysingh@gmail.com','mishraankit@mai.com']
    
}

In [2]:
people['email']

['amitoct9@gmail.com', 'vinaysingh@gmail.com', 'mishraankit@mai.com']

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first    last                 email
0   amit  pratap    amitoct9@gmail.com
1  vinay   singh  vinaysingh@gmail.com
2  ankit  mishra   mishraankit@mai.com

In [6]:
pd['email']

TypeError: 'module' object is not subscriptable

In [7]:
df['email']

0      amitoct9@gmail.com
1    vinaysingh@gmail.com
2     mishraankit@mai.com
Name: email, dtype: object

In [8]:
type(df['email'])

pandas.core.series.Series

In [9]:
df.email

0      amitoct9@gmail.com
1    vinaysingh@gmail.com
2     mishraankit@mai.com
Name: email, dtype: object

In [13]:
df[['last','email']]

     last                 email
0  pratap    amitoct9@gmail.com
1   singh  vinaysingh@gmail.com
2  mishra   mishraankit@mai.com

In [14]:
df[['first','email']]

   first                 email
0   amit    amitoct9@gmail.com
1  vinay  vinaysingh@gmail.com
2  ankit   mishraankit@mai.com

In [15]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [16]:
df.iloc[0]

first                  amit
last                 pratap
email    amitoct9@gmail.com
Name: 0, dtype: object

In [17]:
df.iloc[[0,1]]

   first    last                 email
0   amit  pratap    amitoct9@gmail.com
1  vinay   singh  vinaysingh@gmail.com

In [18]:
df.iloc[[0,1], 2]

0      amitoct9@gmail.com
1    vinaysingh@gmail.com
Name: email, dtype: object

In [19]:
df

   first    last                 email
0   amit  pratap    amitoct9@gmail.com
1  vinay   singh  vinaysingh@gmail.com
2  ankit  mishra   mishraankit@mai.com

In [20]:
df.loc[0]

first                  amit
last                 pratap
email    amitoct9@gmail.com
Name: 0, dtype: object

In [21]:
df.loc[[0,1]]

   first    last                 email
0   amit  pratap    amitoct9@gmail.com
1  vinay   singh  vinaysingh@gmail.com

In [22]:
df.loc[[0,1], 'email']

0      amitoct9@gmail.com
1    vinaysingh@gmail.com
Name: email, dtype: object

In [23]:
df.loc[[0,1],['email','last']]

                  email    last
0    amitoct9@gmail.com  pratap
1  vinaysingh@gmail.com   singh